{"pages":[{"title":"About","text":"About Me 90后中的老腊肉 iOS Dev. 喜欢做的事 和喜欢的人做爱做的事（然而一直孑然一身） 爱折腾（强迫症般的想追求更好） 读书（在我看来，能从外界获取到知识都可以说是读书） 爱好 LOL(已戒，也是够可怜) 🎸 🎵 . . . 梦想 追求自己想要的生活，至于是怎么样的生活，我只能说人生是个漫长的旅程，不同的阶段有不同的追求，生命不止，追求不息！ 其他 Github: https://github.com/Caerfur （已长草） 最后说明 这不是技术博客","link":"/about/index.html"}],"posts":[{"title":"git搬砖修墙之路","text":"前言不出所料，我的博客一定会吃灰。想想，挺对不起它的。 想想最近一段时间真是一事无成 小伙伴创业的提议从去年到今年，依然还是闷在梦里，距离实现遥遥无期。虽然有投入点心思进去，但结果还真是不可说，惭愧。 虽然最近在拍黄片（PHP），但拍黄片成功之路还遥遥不可期。中间大半时间还是打酱油了，想想我iOS都还没成神，还在搬砖的路上，又想着拍黄片了，心真大！ 还有其他等等。。。 git数据恢复闲话不多说。最近写小项目，不对，应该说是玩玩。（手动 尴尬） 花了大半个月折腾完了，心血来潮，想做个版本管理方便后续可能会再折腾，虽然说吃灰的份更多点。然而，我用的Github Desktop这个桌面管理软件，没错，我就是懒得敲命令，虽说这个软件没用过几次。 万恶的事情来了，在commit的时候，看到界面好几个按钮不知干嘛的，人总是好奇的。于是，在一顿胡乱狂点后，出大事。提交记录变成空空如也，关键是源文件也丢失了，丢失了。。。整个目录真是空空如也！ 万幸，在终端查看了下看到隐藏的.git目录还在。于是用git log 查看提交记录，然后懵逼了，提示还没提交过一次。心里顿时千万只羊驼奔腾而过。当时还忘了.git目录下的object目录，第一反应竟然是找个磁盘恢复工具做数据恢复。（手动鄙视自己）瞬间觉得自己好业余，真是搬砖的命，以前学习过又忘了，大概这就是图方面桌面软件用多的弊端。 第二天，因为第一天折腾了好久磁盘恢复失败，后来猛得想起object目录。用git cat－file -p &lt;SHA&gt;命令行，幸运的是，第一个目录里的文件内容就是提交记录，其他文件内容都有幸保存着。然后执行git reset --hard &lt;SHA&gt;命令行，可喜的是提示恢复成功！ git学习大全 授人以渔，授人以鱼 https://git-scm.com/blog 原汁原味的git学习资料，博客质量很高，懒得搬砖，边成自己的总结，有点可耻。(其实就是文笔不好，写不出什么通俗易懂，幽默风趣的文章) 你说英文看不懂？Google浏览器自带翻译光环。 不知不觉，又啰嗦来这么多废话。 The End","link":"/2016/06/16/git搬砖修墙之路/"},{"title":"Hello Hexo","text":"只是折腾闲来无事又折腾起来博客了。正所谓，生命不止，折腾不休，不得不说这个主题挺赞的。OK，这样就好，再折腾就真的要剁手了！ 事实证明，誓言是用来打破的，又折腾了起来（by. 2016.5.1）","link":"/2016/03/03/hello-hexo/"},{"title":"为什么我不写技术博客","text":"本来这里应该是个技术博客，奈何，最后是用来记录生活，记录某一时刻的想法。 现在想写技术相关博文的想法越来越少了，虽然有时候逛逛技术博客或者论坛，遇见或者学到不少东西，有些东西有过深究，有些东西只是浅看。最后只是在收藏夹多了几篇收藏，或者是在Evernote多了几个相关片段。Evernote至今都已陆陆续续雪藏了几百篇零零散散的东西。 想想以前挺爱记东西的，想起来也是血泪史，一直txt/word文档记本地。电脑被偷过，自己装机全盘格式过，想起来都有种掩面默默流泪的赶脚。就像看着自己的孩子一天一天得养起来，突然有一点离自己而去的悲痛。此时，又让我想起小时候亲手种了一棵桃树，养了十几年，最后还是在前几年被砍了。无奈～～ 有时候想把Evernote上的东西整理下，但又有点有心无力。学习工作一直以来都是独当一面（被迫的，多想有老司机带带），技术栈转得又快，想想一两个月入一门，甚至更多。所以，一直忙碌在学习与积累。 更有时候想直接把Evernote上的东西丢Github仓库上或者是gist，想想还是算了，有点太污染了Github。期待有动力弄个比如下面这样的栏目： Learn iOS date by date 拍黄片(PHP) date by date （总有一股莫名的喜感） Learn Embedded date by date（已故）","link":"/2016/05/05/为什么我不写技术博客/"},{"title":"无网络生活这一两个月","text":"前言标题起的略夸张，事情真实情况只是在家的时候没网没信号。住的地方，地处偏僻，手机无信号，几乎等于开着飞行模式。又逢那儿的居委会整顿网络接入问题，网线无情被剪，想着马上会离开这个地方，就一直没去重新拉网线。于是，开始过着无网络生活！ 曾几何时，一个人的生活越来越离不开网络。 无网络生活也一个多月了。有个朋友问我：“没网，那你这个月怎么过来的？”。那么，这一个月我是怎么过来的？几乎每天晚上都花一两个小时看书就是这段时间的生活。本来想说读书的，想想我这样不深读，不写感悟，不写笔记，还是用看书合适点。 书单： 《编程珠玑》 《Objective－C高级编程 iOS与OS X多线程和内存管理》 《PHP从入门到精通》 《Effective Objective-C 2.0 编写高质量iOS与OS X代码的52个有效方》 《黑客与画家》 《编程珠玑》大概浏览了一遍，想起以前挺热衷算法，现在越发觉与算法无缘，已不再有心思去细究算法。这就像跟一个人谈恋爱，有时候，谈着谈着就淡了，最后分了。 《Objective－C高级编程 iOS与OS X多线程和内存管理》抱着七分理解的心态读了一遍，总体来说还是很认真的读了一遍。可惜，读书不写笔记不是个好习惯。大概是读的时候还抱着回头再细读一遍再加点拓展的念头，预计笔记已遥遥无期。当然，也许是懒！ 《PHP从入门到精通》看了大概五分之一，接触了一点基础。自从入嵌入式开发的门失败以后，一直想入后台这个门。奈何！阴差阳错，入了iOS开发这个门，同时，也搬砖了一两年iOS。虽然入门嵌入式开发失败，但是，大学的还是蛮喜欢嵌入式开发的，至少学习的时候“玩”得很开发。现今，想入门后台开发的心又蠢蠢欲动，虽然PHP不一定是最好的选择。 《Effective Objective-C 2.0 编写高质量iOS与OS X代码的52个有效方》把想看的都看得差不多，它跟《Objective－C高级编程 iOS与OS X多线程和内存管理》是两本很经典的书。也纪录了不少“只需要这样做，不说为什么”的内容简结，纯属备忘。 《黑客与画家》这本书虽然看的内容不多，但是感悟最深。特别是对“拒绝平庸”这四个字特别有印象。突然想到一个问题：程序员如何看待编程语言？对于这个问题，不同人有不同的答案。《黑客与画家》拒绝平庸这一章原文有这么一句话： 他们都满足于自己碰巧用熟了的那种语言，他们的编程思想都被那种语言主宰了 作者自述高中时期学习Basic语言经历及他对Blub困境看法。时常听到有些朋友惶恐一门编程语言变得不热门或被别的编程语言取代以后，会怎样会怎样的糟糕。个人觉得没必要担心这种情况，在这个日新月异的年代，学习能力以及适应社会发展的能力是必备的能力。我觉得一个合格的程序员不会缺少学习能力，当然，不仅仅是程序员，还有其他的各行各业各色的人。一个缺少学习能力的人注定被“淘汰”。 所处环境影响眼界，眼界限制思维 让我想起一辈子生活在小乡镇的父辈，他们的经验见识大多都还停留在他们二三十岁时学习到或者积累的见识，而对现今的社会缺少很多认识。虽然我觉得，他们已经被淘汰了，很难在新时代推波助澜。但是，我不能指责他们保守落后、不学习、不接触新事物，因为，几十年的积累不是说改就改的，毕竟，靠这些见识在偏居一偶的小乡镇可以活的很安稳安心。 对于一个人，我可以接受他一开始什么都不懂，但不能接受他一直不进步，一直平庸。这也是我看待一个人是否值得相处或交友的判断准则之一。 后记：写作水平实在是不行了。","link":"/2016/05/03/无网络生活这一两个月/"},{"title":"杂七杂八","text":"简介 “工欲善其事必先利其器” 纪录下个人常用工具箱，浏览网站等等。 Xcode 插件AlcatrazAlcatraz是Xcode的插件管理器，能够让你方便的管理Xcode的插件，上面不仅提供各种插件下载(以下所提到的插件在上面都提供下载)，还有主题。可以说是“一件在手，天下我有！” FuzzyAutocomplete我的最爱，强大的模糊匹配输入。OK，在这里不得不吐槽下iOS命名，那句话怎么说来着？。。。。。。又长又臭！有了它，你绝对可以减少因为记那些方法，枚举值啥的而耗死的脑细胞。 VVDocumenter记得用Eclipse、SourceInsight的时候，强大而文雅的注释风格让我大爱。没错VVDocumenter-Xcode就可以给你提供优雅简明注释。问题来了，不写注释的程序是不是好程序？ KSImageNamed图片加载预览,当你使用[UIImage imageNamed:方法载入图片资源的时候，只要你选中你要的图片，回车键轻轻一敲，你就会体会到它的美妙。 XcodeBoost “An Xcode plugin that aims to make altering and inspecting code quick and easy.” 作者简明一句话概括出它的强大，让你改变和检查代码更快速更容易，具体可以点传送门到Github看演示。 XAlign让你的代码更对齐、美观，处女座？洁癖码农最爱？一切在不言中，23333。 deriveddata-exterminator不知道你用不用，反正我是用了，当你在开发中反反复复编译运行遇到Xcode抽风报红提示因为某个原因要删除某个目录下的文件，或许你会感谢它。 翻墙小能手lantern多平台支持免费开源的翻墙小能手。不会翻墙的程序猿不是一个好司机！ MarkDown编辑器MouMac上免费markdown编辑器，简洁方便，我正在用着呢。 笔记本Evernote写笔记小能手 代码托管github?gitcafe?gitlab? 无论是代码托管还是code review，总有你喜欢的！ git + SoucreTree 代码版本控制管理，简单粗暴，当然，你也可以用Xcode自带的工具或者在终端用命令行（高大上的感觉，如果你偏爱命令行可以到此一游，阮一峰大大会给你惊喜的。 网站生活类：知乎 “与世界分享你的知识、经验和见解” “以问答了解世界，发现更多精彩观点，认真，你就赢了” 可以让你理性了解世界、社会。 V2EX “V2EX 是创意工作者们的社区。” V2EX是这么介绍自己的。分享自己的知识，传递正能量，干净、安静。 技术类：ps:主要介绍iOS开发相关 objc中国 “为中国 Objective-C 社区带来最佳实践和先进技术” 可以说是objc的国人版，苹果开发者应该知道的网站，让你了解如何编写高质量代码。 NSHipster中文版 NSHipster 关注被忽略的 Objective-C、Swift 和 Cocoa 特性。每周更新。 NSHipster国人版，看到我介绍给标上国人版这个标签，。。。。。。我还有什么好说的！总让人想到“山寨”这个词，23333…语文水平有限。 此外，还有不少牛人高质量博客博文，可以参考这份列表传送门 总有你喜欢的。 stackoverflow 专治各种“疑难杂症”，给我带来很大的帮助。话说我一直都是只在上面找答案，没有回答过问题，惭愧惭愧！！！ 小结先这样，后续再添加。 The End!","link":"/2016/03/06/杂七杂八/"}],"tags":[{"name":"git","slug":"git","link":"/tags/git/"},{"name":"Hexo","slug":"Hexo","link":"/tags/Hexo/"},{"name":"杂文","slug":"杂文","link":"/tags/杂文/"},{"name":"杂七杂八","slug":"杂七杂八","link":"/tags/杂七杂八/"}],"categories":[{"name":"修墙路","slug":"修墙路","link":"/categories/修墙路/"},{"name":"Hexo","slug":"Hexo","link":"/categories/Hexo/"},{"name":"杂文","slug":"杂文","link":"/categories/杂文/"},{"name":"工具箱","slug":"工具箱","link":"/categories/工具箱/"}]}